<template>
    <markdown>
        ## 05. 结构体类型

        结构体类型是整个数据类型系统的核心，它基于字段完成数据类型的组合，并定义它们之间的关联。

        以学生成绩结构体为例:
    </markdown>
    <showandtry type="test.person"></showandtry>
    <markdown>
        结构体由多个字段构成，每个字段可以指定任意数据类型，基于数据类型的不同，可以配置不同的参数，例如基础数据类型通常可以配置上下限，如果配置了白名单，则视图会从输入转换为选择。

        对于枚举值可选的比较多，根植，级联限制，黑白名单等等。可以使用时再尝试。

        结构体字段可以通过拖拽调整顺序。字段名称尽可能使用小写。避免传输过程序列化，反序列化不确定因素导致问题。

        下面对一些常用配置做出说明:

        1. 显示名(display): 作为表单的标题使用。
        2. 描述(desc): 辅助说明，需要自定义视图使用。
        3. 必填(require): 必须输入项目，用于校验。
        4. 不可变(immutable): 数据只能输入一次，编辑时不可修改。
        5. 只读(readonly): 数据不可修改，通常通过关联计算写入。
        6. 不可见(invisible): 界面不显示，常用于中间数据。
        7. 仅显示(displayOnly): 仅显示用，数据不会被提交，数据表结构不会生成对应字段，通常基于关联计算，可以配合不可见使用。
        8. 单位(unit): 和显示名一起作为标题使用。
        9. 默认值(default): 基于数据类型的默认值。
        10. 白名单(whiteList): 白名单，用于基础数据和枚举值。
        11. 黑名单(blackList): 黑名单，用于基础数据和枚举值，同时会限制白名单选择。
        12. 下限(lowLimit): 下限值，对于字符串，对应长度。
        13. 上限(upLimit): 上限值，对于字符串，对应长度，仅长度小于等于128位的字符串字段可以作为数组主键。
        14. 仅建议用(asSuggest): 针对基础数据类型，白名单仅作为建议，而不是限制选择。
        15. 使用原始值计算上限(useOriginForUpLimit): 一些特殊场合，例如一组数据具有总数，该节点之前已经占据了一部分数据，那么计算它的上限需要将剩余数加上已占用数才是它的上限值。
        16. 级联限制(cascade): 枚举值级联限制，例如行政区划限制到县级。
        17. 根值(root): 枚举值根植，例如从指定的省份开始显示，但也可以用于基础数据类型，例如命名空间选择视图，指定从特定命名空间开始。
        18. 枚举值任意级可选(anyLevel): 枚举值任意级可选。默认只能选最后一级，在实现参数表功能时，可以配置上级枚举值作为下级枚举值的默认值，否则类似行政区划这种几十万级别的配置很难完成。
        19. 单标志位(singleFlag): 标志枚举值仅允许选择单值，无法选择组合值。

        -----

        在字段列表下，是字段数据关联列表，它可以为字段指定数据关联，例子中的字段不光指结构体字段，还可以为深层字段指定关联。

        例如成绩列表是一个数组，它的元素是结构体，那么就可以为这个结构体的字段指明白名单为学科列表，这是通过选择关系类型为`白名单`，选择函数为`=`做到的。

        实际进行操作时，关系类型会基于所选字段的类型决定，选择后，函数的返回值类型就被确定，选择函数时会基于返回值进行限制。

        函数选择后，参数数量固定，基于参数的类型可以选择对应字段，或者输入固定值。

        下面是关系类型的说明:

        1. 默认值(default): 指定计算默认值，默认值变更时，如果当前值不存在或者当前值和旧默认值一致，当前值会调整为新的默认值。
        2. 根植(root): 枚举值根植。
        3. 黑名单(blackList): 枚举值黑名单，但也可以用于基础数据类型，当白名单存在时使用。注意例子中，成绩列表的学科字段的黑名单指定为从成绩列表中获取所有学科字段，意思即从当前成绩元素之上的其它元素获取所有学科字段，这样可以确保学科不被重复选择，但这不是必须的，数组本身会基于主键进行判定，稍后看例子。
        4. 白名单(whiteList): 枚举值白名单，也可用于基础数据类型指明可选值。
        5. 下限(lowLimit): 基础数据值下限。
        6. 上限(upLimit): 基础数据值上限。
        7. 不可见(invisible): 为true时，画面不显示。
        8. 不可用(disable): 禁止输入。
        9. 强制赋值(assign): 新值强制写入当前值。
        10. 仅初始化用(initOnly): 仅数组添加一行元素时触发，列如写入当前创建人，如果用默认值会导致过往数据出现问题。
        11. 类型切换(type): 系统允许切换字段的类型，但这是比较危险的操作，最好两个类型数据能稍微兼容。在例子中，通过是否使用积点，来切换学科成绩的值字段。实际因为数据关联维护非常复杂，慎用该关联。
        12. 级联限制(cascade): 枚举值级联限制。
        13. 单标志位(singleFlag): 单标志位枚举值。

        -----

        通过字段配置和字段间关联，我们可以实现动态的表单效果，但目前开源部分缺乏后端支持，所以可以实现部分有限，等进一步开源计划实施，再做补充。
    </markdown>
</template>

<script setup lang="ts">
import markdown from '@/components/markdown.vue'
import showandtry from '@/components/showandtry.vue'
</script>