<template>
    <markdown>
        ### 10.1 应用字段

        一个应用可以包含多个子应用，或者包含多个字段。只包含子应用的应用用于提供层级管理。而包含多个字段的应用就是数据应用。数据应用的字段通常会在使用该应用的服务中生成数据表，并由系统完成自动维护工作。
        
        下面列出应用字段新增时各个字段的说明, 可以自行在应用管理界面进行新增尝试。

        1. 字段名：字段名称，会和应用名一起决定在后台生成的数据库表名称。也是前后端访问数据时的字段名。
        2. 字段类型：字段数据类型，决定前端如何呈现数据，后端数据表结构如何构建。
        3. 字段展示：字段展示名。
        4. 字段描述：字段详细描述。
        5. 引用应用：字段数据可以从其他应用中引入，应用引用中详细说明。
        6. 引用字段：引用应用提供时可用，用于选择引入的字段，引入时，如果字段名，类型，展示均为指定，会使用引用字段的相关信息。
        7. 增量数据：当字段数据类型为数组，并且数组元素类型为结构体时，它的数据量是未可知的，如果无法确定它未来的数据量，就可以选择增量数据，增量数据只允许部分更新，自带分页等操作逻辑。后续在默认视图介绍时说明。
        8. 禁用：禁用该字段，因为字段会和数据表关联，禁用可以确保随时能恢复访问。
        9. 计算函数：字段可以分为输入字段和输出字段，输入字段用于前端录入数据，数据提交给后端后，后端基于计算函数产生的关联，将输入数据经过计算后得到差值，这部分差值可以被汇总保存到输出字段中。
        10. 函数参数：指定计算函数后，可以为基于函数的参数绑定输入字段，仅允许绑定输入字段，不允许常量值。
        11. 数据合并规则：作为输出字段，其接受的数据主键是可能重复的，这时对其中的数据字段就需要进行汇总，例如合计，最小值，最大值等，这里指定合并规则。

        除了定义字段外，应用编辑中也可以定义各个字段间的数据关联，例如测试用例中，学科列表会限制学生列表中的学科列表可选项目，这部分关联仅仅涉及前端的联动呈现。
    </markdown>
</template>

<script lang="ts" setup>
import markdown from '@/components/markdown.vue'
</script>